Dlubal.RFEM5.IMember
Interface for working with member

Dlubal.RFEM5.IMember.GetData
Gets member parameters.
Returns: Member parameters

Dlubal.RFEM5.IMember.SetData(System.UInt32@)
Sets member parameters.
Member: Member parameters

Dlubal.RFEM5.IMember.Delete
Deletes member.

Dlubal.RFEM5.IMember.GetExtraData
Returns interface for working with extra data depending on member type.
Returns: Interface for working with member extra data.

Dlubal.RFEM5.IMember.GetLocalCoordinateSystem(System.Double)
Gets member local coordinate system.
Returns: Local coordinate system interface
Param: Parameter in interval

Dlubal.RFEM5.IMember.GetEccentricity(System.Double,System.Boolean)
Gets member eccentricity.
Returns: Member eccentricity
Param: Parameter in interval
LocalCS: Set to true if you wish to get eccentricity in local coordinate system, otherwise set to false.

Dlubal.RFEM5.IMember.GetEffectiveLengths
Gets member effective lengths.
Returns: Member effective lengths

Dlubal.RFEM5.IMember.SetEffectiveLengths(System.UInt32@)
Sets member effective lengths.
EffectiveLengths: Member effective lengths

Dlubal.RFEM5.IMember.GetStiffnessFactors
Gets member stiffness factors.
Returns: Member stiffness factors

Dlubal.RFEM5.IMember.SetStiffnessFactors(System.UInt32@)
Sets member stiffness factors.
Factors: Member stiffness factors